[Update DHCP Hostname Lookup]
description = Refreshes the routeros_dhcp_hostnames_lookup lookup with the latest IP-to-hostname mappings from DHCP assignment events. Runs every 15 minutes over the last 24 hours.
search = `routeros_index` sourcetype=routeros eventtype=routeros_dhcp vendor_action=assigned dest_nt_host=* \
| stats latest(_time) as last_seen, latest(dest_nt_host) as dest_nt_host, latest(dest_mac) as dest_mac, latest(lease_scope) as lease_scope by dest_ip \
| inputlookup append=true routeros_dhcp_hostnames_lookup \
| stats latest(last_seen) as last_seen, latest(dest_nt_host) as dest_nt_host, latest(dest_mac) as dest_mac, latest(lease_scope) as lease_scope by dest_ip \
| outputlookup routeros_dhcp_hostnames_lookup
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = */15 * * * *
enableSched = 1
realtime_schedule = 0
is_visible = 0
